# CreateNewXMLDocument

## Description
Creates a new XML document.

```pascal
FUNCTION CreateNewXMLDocument(
				XMLHandle       : LONGINT;
				rootElementName : DYNARRAY[] of CHAR) : INTEGER;
```

```python

def vs.CreateNewXMLDocument(XMLHandle, rootElementName):
    return INTEGER
```

## Parameters
|Name|Type|Description|
|---|---|---|
|XMLHandle|LONGINT||
|rootElementName|DYNARRAY[] of CHAR||

## Version
Availability: from Vectorworks 2011
## Category
* XML